app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "7"]]
UPDATE "movies" SET "cast" = ?, "director" = ?, "updated_at" = ? WHERE "movies"."id" = 7  [["cast", ""], ["director", ""], ["updated_at", Thu, 22 May 2014 14:03:36 UTC +00:00]]
---
  def update
    @movie = Movie.find(params[:id])
    if @movie.update(movie_params)

INSERT INTO "movies" ("cast", "created_at", "description", "director", "duration", "image_file_name", "rating", "released_on", "title", "total_gross", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @movie = Movie.new(movie_params)
    if @movie.save